In [1]:
country_codes = {'Finland': 'fi', 'South Africa': 'za', 'Nepal': 'np'}

In [2]:
country_codes

{'Finland': 'fi', 'South Africa': 'za', 'Nepal': 'np'}

In [3]:
len(country_codes)

3

In [7]:
"""Tokenizing a string and counting unique words."""
text = ('this is sample text with several words '
       'this is more sample text with some different words')
word_counts = {}

In [8]:
for word in text.split():
    if word in word_counts:
        word_counts[word] +=1 # update existing key-value pair
    else:
        word_counts[word] = 1 # insert new key-value pair
print (f'{"WORD":<12}COUNT')

for word, count in sorted(word_counts.items()):
    print(f'{word:<12}{count}')

print('\nNumber of unique words: ', len(word_counts))

WORD        COUNT
different   1
is          2
more        1
sample      2
several     1
some        1
text        2
this        2
with        2
words       2

Number of unique words:  10

In [9]:
from collections import Counter

In [10]:
text = ('this is sample text with several words '
       'this is more sample text with some different words')

In [11]:
counter = Counter(text.split())

In [12]:
for word, count in sorted(counter.items()):
    print(f'{word:<12}{count}')

different   1
is          2
more        1
sample      2
several     1
some        1
text        2
this        2
with        2
words       2

In [13]:
print('Number of unique keys: ', len(counter.keys()))

Number of unique keys:  10

In [14]:
import re

In [15]:
re.sub(r'\t', ', ', '1\t2\t3\t4')

'1, 2, 3, 4'

In [18]:
result2 = re.search('fun ', 'Python is fun')

In [19]:
result2.group() if result2 else 'not found'

'not found'

In [20]:
result3 = re.search('Sam', 'SAM WHITE', flags=re.IGNORECASE)

In [21]:
result3.group() if result3 else 'not found'

'SAM'

In [22]:
contact = 'Wally White, Home: 555-555-1234, Work:555-555-4321'

In [23]:
re.findall(r'\d{3}-\d{3}-\d{4}', contact)

['555-555-1234', '555-555-4321']

In [25]:
for phone in re.finditer(r'\d{3}-\d{3}-\d{4}', contact):
    print(phone.group())

555-555-1234
555-555-4321

In [38]:
text='Charlie Cyan, e-mail: demo1@deitel.com'

In [45]:
pattern = r'([A-Z][a-z]+ [A-Z][a-z]+), e-mail: (\w+@\w+\.\w{3})'

In [46]:
result = re.search(pattern, text)

In [47]:
result.groups()

('Charlie Cyan', 'demo1@deitel.com')

In [48]:
result.group()

'Charlie Cyan, e-mail: demo1@deitel.com'

In [49]:
result.group(1)

'Charlie Cyan'

In [50]:
result.group(2)

'demo1@deitel.com'

In [51]:
import pandas as pd

In [55]:
zips = pd.Series({'Boston':'02233', 'Miami': '2232'})

In [56]:
zips

Boston    02233
Miami      2232
dtype: object

In [58]:
zips.str.match(r'\d{4}')

Boston    True
Miami     True
dtype: bool

In [61]:
cities = pd.Series(['Boston, MA 02215', 'Miami, FL 33101'])

In [62]:
cities

0    Boston, MA 02215
1     Miami, FL 33101
dtype: object

In [63]:
cities.str.contains(r' [A-Z]{2} ')

0    True
1    True
dtype: bool

In [64]:
cities.str.match(r' [A-Z]{2}')

0    False
1    False
dtype: bool

In [66]:
contacts=[['Mike Green', 'demo1@deitel.com', '5555555555'],
          ['Sue Brown', 'demo2@deitel.com', '5555551234']]

In [67]:
contactsdf = pd.DataFrame(contacts, columns=['Name', 'Email', 'Phone'])

In [68]:
contactsdf

         Name             Email       Phone
0  Mike Green  demo1@deitel.com  5555555555
1   Sue Brown  demo2@deitel.com  5555551234

In [69]:
import re

In [70]:
def get_formatted_phone(value):
    result = re.fullmatch(r'(\d{3})(\d{3})(\d{4})', value)
    return '-'.join(result.groups()) if result else value

In [71]:
formatted_phone = contactsdf['Phone'].map(get_formatted_phone)

In [72]:
formatted_phone

0    555-555-5555
1    555-555-1234
Name: Phone, dtype: object

In [73]:
contactsdf['Phone']=formatted_phone

In [74]:
contactsdf

         Name             Email         Phone
0  Mike Green  demo1@deitel.com  555-555-5555
1   Sue Brown  demo2@deitel.com  555-555-1234

In [75]:
with open('accounts.txt', mode='w') as accounts:
    accounts.write('100 Jones 24.98\n')
    accounts.write('200 Doe 345.67\n')
    accounts.write('300 White 0.00\n')
    accounts.write('400 Stone -42.16\n')
    accounts.write('500 Rich 224.62\n')

In [83]:
with open('accounts.txt', mode='r') as accounts:
    print(f'{"Account":<10}{"Name":<10}{"Balance":>10}')
    for record in accounts:
        account, name, balance = record.split()
        print(f'{account:<10}{name:<10}{balance:>10}')

Account   Name         Balance
100       Jones          24.98
200       Doe           345.67
300       White           0.00
400       Stone         -42.16
500       Rich          224.62

In [85]:
accounts = open('accounts.txt', 'r')

In [86]:
temp_file = open('temp_file.txt', 'w')

In [91]:
with accounts, temp_file:
    for record in accounts:
        account, name, balance = record.split()
        if account != '300':
            temp_file.write(record)
        else :
            new_record = ' '.join([account, 'Williams', balance])
            temp_file.write(new_record + '\n')

In [96]:
import os

In [97]:
os.remove('accounts.txt')

In [98]:
os.rename('temp_file.txt', 'accounts.txt')

In [101]:
accounts_dict = {'accounts': [
                 {'account':100, 'name':'Jones', 'balance':24.98},
                 {'account':200, 'name':'Doe', 'balance':345.67}]}

In [102]:
import json

In [103]:
with open('accounts.json', 'w') as accounts:
    json.dump(accounts_dict, accounts)

In [104]:
with open('accounts.json', 'r') as accounts:
    accounts_json = json.load(accounts)

In [105]:
accounts_json

{'accounts': [{'account': 100, 'name': 'Jones', 'balance': 24.98},
  {'account': 200, 'name': 'Doe', 'balance': 345.67}]}

In [107]:
accounts_json['accounts']

[{'account': 100, 'name': 'Jones', 'balance': 24.98},
 {'account': 200, 'name': 'Doe', 'balance': 345.67}]

In [108]:
accounts_json['accounts'][0]

{'account': 100, 'name': 'Jones', 'balance': 24.98}

In [109]:
accounts_json['accounts'][1]

{'account': 200, 'name': 'Doe', 'balance': 345.67}

In [111]:
with open ('accounts.json', 'r') as accounts:
    print(json.dumps(json.load(accounts), indent=4))

{
    "accounts": [
        {
            "account": 100,
            "name": "Jones",
            "balance": 24.98
        },
        {
            "account": 200,
            "name": "Doe",
            "balance": 345.67
        }
    ]
}

In [112]:
import csv

In [113]:
with open('accounts.csv', mode='w', newline='') as accounts:
    writer = csv.writer(accounts)
    writer.writerow([100,'Jones', 24.98])
    writer.writerow([200,'Doe',345.67])
    writer.writerow([300,'White',0.00])
    writer.writerow([400,'Stone', -42.16])
    writer.writerow([500, 'Rich',224.62])

In [115]:
with open('accounts.csv', 'r', newline='') as accounts:
    print(f'{"Account":<10}{"Name":<10}{"Balance":>10}')
    reader=csv.reader(accounts)
    for record in reader:
        account, name, balance = record
        print(f'{account:<10}{name:<10}{balance:>10}')

Account   Name         Balance
100       Jones          24.98
200       Doe           345.67
300       White            0.0
400       Stone         -42.16
500       Rich          224.62

In [116]:
import pandas as pd

In [117]:
df = pd.read_csv('accounts.csv',names=['account', 'name', 'balance'])

In [118]:
df

   account   name  balance
0      100  Jones    24.98
1      200    Doe   345.67
2      300  White     0.00
3      400  Stone   -42.16
4      500   Rich   224.62

In [119]:
import pandas as pd

In [123]:
titanic = pd.read_csv('https://vincentarelbundock.github.io/Rdatasets/csv/carData/TitanicSurvival.csv')

In [124]:
pd.set_option('precision', 2) # format for floating-point val

In [126]:
titanic.head()

                        Unnamed: 0 survived     sex    age passengerClass
0    Allen, Miss. Elisabeth Walton      yes  female  29.00            1st
1   Allison, Master. Hudson Trevor      yes    male   0.92            1st
2     Allison, Miss. Helen Loraine       no  female   2.00            1st
3  Allison, Mr. Hudson Joshua Crei       no    male  30.00            1st
4  Allison, Mrs. Hudson J C (Bessi       no  female  25.00            1st

In [127]:
titanic.tail()

                     Unnamed: 0 survived     sex   age passengerClass
1304       Zabour, Miss. Hileni       no  female  14.5            3rd
1305      Zabour, Miss. Thamine       no  female   NaN            3rd
1306  Zakarian, Mr. Mapriededer       no    male  26.5            3rd
1307        Zakarian, Mr. Ortin       no    male  27.0            3rd
1308         Zimmerman, Mr. Leo       no    male  29.0            3rd

In [128]:
titanic.columns = ['name','survived','sex','age','class']

In [129]:
titanic.head()

                              name survived     sex    age class
0    Allen, Miss. Elisabeth Walton      yes  female  29.00   1st
1   Allison, Master. Hudson Trevor      yes    male   0.92   1st
2     Allison, Miss. Helen Loraine       no  female   2.00   1st
3  Allison, Mr. Hudson Joshua Crei       no    male  30.00   1st
4  Allison, Mrs. Hudson J C (Bessi       no  female  25.00   1st

In [130]:
titanic.describe()

           age
count  1046.00
mean     29.88
std      14.41
min       0.17
25%      21.00
50%      28.00
75%      39.00
max      80.00

In [131]:
(titanic.survived=='yes').describe()

count      1309
unique        2
top       False
freq        809
Name: survived, dtype: object

In [132]:
%matplotlib

Using matplotlib backend: TkAgg

In [133]:
historgram = titanic.hist()